# GridNode Structure

---
C#Visual BasicVisual C++
Revit 2024 API
---
GridNode Structure
Members See Also
---
A structure that represents a particular location in (U,V) from a grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public struct GridNode
```

Visual Basic
---
```text
Public Structure GridNode
```

Visual C++
---
```text
public value class GridNode
```

# See Also
GridNode Members
Autodesk.Revit.DB Namespace